alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREcommon.cpp
        if(OF_Prefs::pins[OF_Const::autofireSwitch] >= 0)
            pinMode(OF_Prefs::pins[OF_Const::autofireSwitch], INPUT);
    #endif // USES_SWITCHES

    #ifdef LED_ENABLE
        OF_RGB::LedOff();

        #ifdef FOURPIN_LED
            if(ledIsValid) {
                pinMode(OF_Prefs::pins[OF_Const::ledR], INPUT);
                pinMode(OF_Prefs::pins[OF_Const::ledG], INPUT);
                pinMode(OF_Prefs::pins[OF_Const::ledB], INPUT);
            }
        #endif // FOURPIN_LED

        #ifdef CUSTOM_NEOPIXEL
            if(OF_RGB::externPixel != nullptr) {
                OF_RGB::externPixel->clear();
                delete OF_RGB::externPixel;
                OF_RGB::externPixel = nullptr;
            }
        #endif // CUSTOM_NEOPIXEL
    #endif // LED_ENABLE

    #ifdef USES_DISPLAY
        if(OLED.display != nullptr)
            OLED.Stop();
    #endif // USES_DISPLAY
}

void FW_Common::CameraSet()
{

    #ifdef PAJ7025_CAM
    #ifdef ARDUINO_ARCH_ESP32
    // usa OF_Prefs::pins[OF_Const::camSDA] per MISO
    // usa OF_Prefs::pins[OF_Const::camSCL] per CLOCK
    // il clock lo impostiamo a 2 Mhz per stabilita' - max a 14 Mhz o 8 Mhz fisso
 
    // forzo impostazioni provvisoriamente
    OF_Prefs::pins[OF_Const::cam_PAJ7025_SCK] =  12;   // GPIO 12  Clock SPI (SCK) (clock)
    OF_Prefs::pins[OF_Const::cam_PAJ7025_MISO] = 13;   // GPIO 13 -  pin di LETTURA dal sensore (RX lettura)
    OF_Prefs::pins[OF_Const::cam_PAJ7025_MOSI] = 11;   // GPIO 11 - pin di SCRITTURA dal sensore (TX scrittura)
    OF_Prefs::pins[OF_Const::cam_PAJ7025_CS] =   10;   // GPIO 10 -  CS/SS del modulo
    
    #define SPI_SCK_PIN   OF_Prefs::pins[OF_Const::cam_PAJ7025_SCK]   // Ex SCL -> diventa il Clock SPI (SCK) (clock)
    #define SPI_MISO_PIN  OF_Prefs::pins[OF_Const::cam_PAJ7025_MISO]  // Ex SDA -> diventa il pin di LETTURA dal sensore (RX lettura)
    #define SPI_MOSI_PIN  OF_Prefs::pins[OF_Const::cam_PAJ7025_MOSI]  // Metto -1 se non lo collego/non lo uso (TX scrittura)
    #define SPI_CS_PIN    OF_Prefs::pins[OF_Const::cam_PAJ7025_CS]    //  CS/SS del modulo

    SPIClass* SPIWire = nullptr;

    SPIWire = new SPIClass(FSPI); // FSPI = SPI2 bus -- HSPI = SPI3 bus (SPI0 && SPI1 reserved for flash/psram)
    bool spi_begin = SPIWire->begin(SPI_SCK_PIN, SPI_MISO_PIN, SPI_MOSI_PIN, SPI_CS_PIN);
    /*
    #ifdef USES_DISPLAY
        if (spi_begin)
            FW_Common::OLED.TopPanelUpdate(" SPI OK ");
        else 
            FW_Common::OLED.TopPanelUpdate(" SPI ERROR ");
        delay(1000);
    #endif //USES_DISPLAY
    */
    dfrIRPos = new DFRobotIRPositionEx(SPIWire,SPI_CS_PIN);
    #else // rp2040 

    #define SPI_SCK_PIN   OF_Prefs::pins[OF_Const::cam_PAJ7025_SCK]  // Ex SCL -> diventa il Clock SPI (SCK) (clock)
    #define SPI_MISO_PIN  OF_Prefs::pins[OF_Const::cam_PAJ7025_MISO]  // Ex SDA -> diventa il pin di LETTURA dal sensore (RX lettura)
    #define SPI_MOSI_PIN  OF_Prefs::pins[OF_Const::cam_PAJ7025_MOSI]  // Metto -1 se non lo collego/non lo uso (TX scrittura)
    #define SPI_CS_PIN    OF_Prefs::pins[OF_Const::cam_PAJ7025_CS]  // Metto -1 se il CS del modulo è collegato fisicamente a GND (cable select)

    // SPI1 se si vuole lavorare sul secondo canale
    SPI.setSCK(SPI_SCK_PIN);
    SPI.setMISO(SPI_MISO_PIN); 
    SPI.setMOSI(SPI_MOSI_PIN);
    SPI.setCS(SPI_CS_PIN);

    SPI.begin();

    dfrIRPos = new DFRobotIRPositionEx(&SPI, SPI_CS_PIN);

    #endif // rp2040
    #else
    #ifdef ARDUINO_ARCH_ESP32
        Wire.setPins(OF_Prefs::pins[OF_Const::camSDA], OF_Prefs::pins[OF_Const::camSCL]); // MODIFICATO [ESP32_PORT] per ESP32
        dfrIRPos = new DFRobotIRPositionEx(Wire);
    #else // rp2040   
    // Sanity check: which channel do these pins correlate to?
    if(bitRead(OF_Prefs::pins[OF_Const::camSCL], 1) && bitRead(OF_Prefs::pins[OF_Const::camSDA], 1)) {
        // I2C1
        if(bitRead(OF_Prefs::pins[OF_Const::camSCL], 0) && !bitRead(OF_Prefs::pins[OF_Const::camSDA], 0)) {
            // SDA/SCL are indeed on verified correct pins
            Wire1.setSDA(OF_Prefs::pins[OF_Const::camSDA]);
            Wire1.setSCL(OF_Prefs::pins[OF_Const::camSCL]);
            dfrIRPos = new DFRobotIRPositionEx(Wire1);
        }
        
    } else if(!bitRead(OF_Prefs::pins[OF_Const::camSCL], 1) && !bitRead(OF_Prefs::pins[OF_Const::camSDA], 1)) {
        // I2C0
        if(bitRead(OF_Prefs::pins[OF_Const::camSCL], 0) && !bitRead(OF_Prefs::pins[OF_Const::camSDA], 0)) {
            // SDA/SCL are indeed on verified correct pins
            Wire.setSDA(OF_Prefs::pins[OF_Const::camSDA]);
            Wire.setSCL(OF_Prefs::pins[OF_Const::camSCL]);
            dfrIRPos = new DFRobotIRPositionEx(Wire);
        }
    }
    #endif // rp2040
    #endif // PAJ7025_CAM

    #ifndef PAJ7025_CAM
    #ifdef ARDUINO_ARCH_RP2040
    if(OF_Prefs::pins[OF_Const::wiiClockGen] > -1) {
        set_sys_clock_khz(125000, true);
        gpio_set_function(OF_Prefs::pins[OF_Const::wiiClockGen], GPIO_FUNC_PWM);
        uint slice_num = pwm_gpio_to_slice_num(OF_Prefs::pins[OF_Const::wiiClockGen]);
        pwm_set_clkdiv(slice_num, 1.0f);  // for sys_clock = 125MHz
        //pwm_set_clkdiv(slice_num, 3.0f); // for sys_clock = 150MHz
        pwm_set_wrap(slice_num, 4);
        pwm_set_chan_level(slice_num, pwm_gpio_to_channel(OF_Prefs::pins[OF_Const::wiiClockGen]), 2);
        pwm_set_enabled(slice_num, true);
    } else {
        set_sys_clock_khz(133000, true);
        pwm_set_enabled(pwm_gpio_to_slice_num(OF_Prefs::pins[OF_Const::wiiClockGen]), false);
        gpio_set_function(OF_Prefs::pins[OF_Const::wiiClockGen], GPIO_FUNC_SIO);
        gpio_put(OF_Prefs::pins[OF_Const::wiiClockGen], 0);
        gpio_set_dir(OF_Prefs::pins[OF_Const::wiiClockGen], GPIO_IN);
    }
    #endif // ARDUINO_ARCH_RP2040
    
    
    #ifdef ARDUINO_ARCH_ESP32
        // --- CLOCK WII CAMERA: 24 MHz @ 50% DC ---
        #ifdef CLOCK_CAM_WII
            /*
            #define WII_CLOCK_FREQUENCY_HZ 25000000  // 25 MHz target //la cam wii parla di 24Mhz ma OpenFire la imposta a 25Mhz
            // il sistema riesce a produrre Hz 24975610    .... ma con jitter il clock non è mai stabile
            */
            #define WII_CLOCK_FREQUENCY_HZ 20000000  // 20 MHz target (integer division of 80MHz APB to prevent jitter) .. così il clock è stabile e la cam funziona bene tra 20 e 25Mhz
            
            #define WII_CLOCK_DUTY_CYCLE 1      // 50%

            const int gpio_pin = OF_Prefs::pins[OF_Const::wiiClockGen];  // gpio 10 sia su Esp32 pico che su esp32 wroom, si imposta da board

            if (gpio_pin > -1) {
                if (!ledcSetClockSource(LEDC_AUTO_CLK/*LEDC_USE_APB_CLK*/)) log_e("ERRORE: ledcSetClockSource fallita!"); //LEDC_USE_XTAL_CLK     // LEDC_USE_APB_CLK     // LEDC_AUTO_CLK  //  RC_FAST_CLK
                if (!ledcAttach(gpio_pin, WII_CLOCK_FREQUENCY_HZ, 1)) { // risoluzione ad 1 per sfruttare il clock più alto possibile          
                    log_e("ERRORE: ledcAttach fallita!");
                } else {
                    if (!ledcWrite(gpio_pin, WII_CLOCK_DUTY_CYCLE)) {
                        log_e("ERRORE: ledcWrite fallita!");
                        ledcDetach(gpio_pin);
                    } 
                }
            } else {
                log_e("Clock non attivato (GPIO %d non valido: <= -1).\n", gpio_pin);
            }
        #endif // CLOCK_CAM_WII
    #endif // ARDUINO_ARCH_ESP32
    #endif // #ifndef PAJ7025_CAM

    // Start IR Camera with basic data format
    if(dfrIRPos != nullptr) {
        if(!dfrIRPos->begin(DFROBOT_IR_IIC_CLOCK, DFRobotIRPositionEx::DataFormat_Basic, (DFRobotIRPositionEx::Sensitivity_e)OF_Prefs::profiles[OF_Prefs::currentProfile].irSens)) {
            /*
            #ifdef USES_DISPLAY    
                FW_Common::OLED.TopPanelUpdate(" CAM ERROR ");
                delay(1000);
            #endif //USES_DISPLAY
            */
            delete dfrIRPos;
            dfrIRPos = nullptr;
            PrintIrError();
        } else 
        {
            camNotAvailable = false;
            /*
            #ifdef USES_DISPLAY    
                FW_Common::OLED.TopPanelUpdate(" CAM OK ");
                delay(1000);
            #endif //USES_DISPLAY
            */
        }
    } else PrintIrError();
}

