alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREcommon.cpp
    Serial.printf("%c%c", OF_Const::sCaliStageUpd, FW_Const::Cali_Verify+1);
    Serial.flush();
}

void FW_Common::GetPosition()
{
    if(dfrIRPos != nullptr) {
        int error = dfrIRPos->basicAtomic(DFRobotIRPositionEx::Retry_2);
        if(error == DFRobotIRPositionEx::Error_Success) {
           
            // if diamond layout, or square
            if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout) { // layoutDiamond = 1
                OpenFIREdiamond.begin(dfrIRPos->xPositions(), dfrIRPos->yPositions(), dfrIRPos->seen());

                OpenFIREper.warp(OpenFIREdiamond.X(0), OpenFIREdiamond.Y(0),
                                OpenFIREdiamond.X(1), OpenFIREdiamond.Y(1),
                                OpenFIREdiamond.X(2), OpenFIREdiamond.Y(2),
                                OpenFIREdiamond.X(3), OpenFIREdiamond.Y(3),
                                res_x / 2, 0, 0,
                                res_y / 2, res_x / 2,
                                res_y, res_x, res_y / 2);
            } else { // layoutSquare = 0
                OpenFIREsquare.begin(dfrIRPos->xPositions(), dfrIRPos->yPositions(), dfrIRPos->seen());              
               
                #ifdef USE_MULTI_ONE_EURO_FILTER 
                    X_in[0] = OpenFIREsquare.X(0);
                    Y_in[0] = OpenFIREsquare.Y(0);
                    X_in[1] = OpenFIREsquare.X(1);
                    Y_in[1] = OpenFIREsquare.Y(1);
                    X_in[2] = OpenFIREsquare.X(2);
                    Y_in[2] = OpenFIREsquare.Y(2);
                    X_in[3] = OpenFIREsquare.X(3);
                    Y_in[3] = OpenFIREsquare.Y(3);          

                    oef_multi.process(X_in, Y_in, X_out, Y_out);

                    OpenFIREper.warp(X_out[0], Y_out[0],
                                X_out[1], Y_out[1],
                                X_out[2], Y_out[2],
                                X_out[3], Y_out[3],
                                OF_Prefs::profiles[OF_Prefs::currentProfile].TLled, 0,
                                OF_Prefs::profiles[OF_Prefs::currentProfile].TRled, 0,
                                OF_Prefs::profiles[OF_Prefs::currentProfile].TLled, res_y,
                                OF_Prefs::profiles[OF_Prefs::currentProfile].TRled, res_y);
   
                #else
                    OpenFIREper.warp(OpenFIREsquare.X(0), OpenFIREsquare.Y(0),
                                OpenFIREsquare.X(1), OpenFIREsquare.Y(1),
                                OpenFIREsquare.X(2), OpenFIREsquare.Y(2),
                                OpenFIREsquare.X(3), OpenFIREsquare.Y(3),
                                OF_Prefs::profiles[OF_Prefs::currentProfile].TLled, 0,
                                OF_Prefs::profiles[OF_Prefs::currentProfile].TRled, 0,
                                OF_Prefs::profiles[OF_Prefs::currentProfile].TLled, res_y,
                                OF_Prefs::profiles[OF_Prefs::currentProfile].TRled, res_y);
                #endif // USE_MULTI_ONE_EURO_FILTER 

            }

            // Output mapped to screen resolution because offsets are measured in pixels
            mouseX = map(OpenFIREper.getX(), 0, res_x, (0 - OF_Prefs::profiles[OF_Prefs::currentProfile].leftOffset), (res_x + OF_Prefs::profiles[OF_Prefs::currentProfile].rightOffset));                 
            mouseY = map(OpenFIREper.getY(), 0, res_y, (0 - OF_Prefs::profiles[OF_Prefs::currentProfile].topOffset), (res_y + OF_Prefs::profiles[OF_Prefs::currentProfile].bottomOffset));         

            switch(runMode) {
                case FW_Const::RunMode_Average:
                    // 2 position moving average
                    moveIndex ^= 1;
                    moveXAxisArr[moveIndex] = mouseX;
                    moveYAxisArr[moveIndex] = mouseY;
                    mouseX = (moveXAxisArr[0] + moveXAxisArr[1]) / 2;
                    mouseY = (moveYAxisArr[0] + moveYAxisArr[1]) / 2;
                    break;
                case FW_Const::RunMode_Average2:
                    // weighted average of current position and previous 2
                    if(moveIndex < 2)
                        ++moveIndex;
                    else moveIndex = 0;

                    moveXAxisArr[moveIndex] = mouseX;
                    moveYAxisArr[moveIndex] = mouseY;
                    mouseX = (mouseX + moveXAxisArr[0] + moveXAxisArr[1] + moveXAxisArr[2]) / 4;
                    mouseY = (mouseY + moveYAxisArr[0] + moveYAxisArr[1] + moveYAxisArr[2]) / 4;
                    break;
                default:
                    break;
                }

            // Constrain that bisch so negatives don't cause underflow
            int32_t conMoveX = constrain(mouseX, 0, res_x);
            int32_t conMoveY = constrain(mouseY, 0, res_y);

            if(gunMode == FW_Const::GunMode_Run) {
                UpdateLastSeen();

                if(OF_Serial::serialARcorrection) switch(OF_Prefs::profiles[OF_Prefs::currentProfile].aspectRatio) {
                    case OF_Const::ar16_9:
                        conMoveX = map(conMoveX, 966, 6720, 0, 32767);
                        conMoveX = constrain(conMoveX, 0, 32767);
                        conMoveY = map(conMoveY, 0, res_y, 0, 32767);
                        break;
                    case OF_Const::ar16_10:
                        conMoveX = map(conMoveX, 655, 7048, 0, 32767);
                        conMoveX = constrain(conMoveX, 0, 32767);
                        conMoveY = map(conMoveY, 0, res_y, 0, 32767);
                        break;
                    case OF_Const::ar3_2:
                        conMoveX = map(conMoveX, 438, 7264, 0, 32767);
                        conMoveX = constrain(conMoveX, 0, 32767);
                        conMoveY = map(conMoveY, 0, res_y, 0, 32767);
                        break;
                    case OF_Const::ar5_4:
                        conMoveX = map(conMoveX, 0, res_x, 0, 32767);
                        conMoveY = map(conMoveY, 148, 4182, 0, 32767);
                        conMoveY = constrain(conMoveY, 0, 32767);
                        break;
                    case OF_Const::ar4_3:
                    default:
                        // Output mapped to Mouse resolution
                        conMoveX = map(conMoveX, 0, res_x, 0, 32767);
                        conMoveY = map(conMoveY, 0, res_y, 0, 32767);
                        break;
                } else {
                    // Output mapped to Mouse resolution
                    conMoveX = map(conMoveX, 0, res_x, 0, 32767);
                    conMoveY = map(conMoveY, 0, res_y, 0, 32767);
                }

                bool offXAxis = false;
                bool offYAxis = false;

                if(conMoveX == 0 || conMoveX == 32767)
                    offXAxis = true;
                
                if(conMoveY == 0 || conMoveY == 32767)
                    offYAxis = true;

                if(offXAxis || offYAxis)
                     buttons.offScreen = true;
                else buttons.offScreen = false;

